#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.application_insights["app_insight1"].azurerm_application_insights.application_insights will be created
  + resource "azurerm_application_insights" "application_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "app-insight-elx-demo-001"
      + resource_group_name                   = "elex-demo-eu2-rg-0001"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application" = "elx"
          + "costcentre"  = "tbc"
          + "createdby"   = "IaC"
        }
      + workspace_id                          = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.OperationalInsights/workspaces/elex-law-demo-001"
    }

  # module.machine_learning["mlw1"].data.azurerm_application_insights.application_insights will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_insights" "application_insights" {
      + app_id              = (known after apply)
      + application_type    = (known after apply)
      + connection_string   = (sensitive value)
      + id                  = (known after apply)
      + instrumentation_key = (known after apply)
      + location            = (known after apply)
      + name                = "app-insight-elx-demo-001"
      + resource_group_name = "elex-demo-eu2-rg-0001"
      + retention_in_days   = (known after apply)
      + tags                = (known after apply)
      + workspace_id        = (known after apply)
    }

  # module.machine_learning["mlw1"].data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "kvelxdeveun-001"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "elex-demo-eu2-rg-0001"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.machine_learning["mlw1"].data.azurerm_storage_account.storage_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account" "storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = (known after apply)
      + account_replication_type          = (known after apply)
      + account_tier                      = (known after apply)
      + allow_nested_items_to_be_public   = (known after apply)
      + azure_files_authentication        = (known after apply)
      + custom_domain                     = (known after apply)
      + enable_https_traffic_only         = (known after apply)
      + id                                = (known after apply)
      + identity                          = (known after apply)
      + infrastructure_encryption_enabled = (known after apply)
      + is_hns_enabled                    = (known after apply)
      + location                          = (known after apply)
      + name                              = "stmhradeveunelx01"
      + nfsv3_enabled                     = (known after apply)
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = (known after apply)
      + resource_group_name               = "elex-demo-eu2-rg-0001"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + table_encryption_key_type         = (known after apply)
      + tags                              = (known after apply)
    }

  # module.machine_learning["mlw1"].data.azurerm_subnet.subnet_mlcc["mlcc1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "subnet_mlcc" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ml-snet-001"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "elex-demo-eu2-rg-0001"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "elex-demo-eu2-vnet-0001"
    }

  # module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster["mlcc1"] will be created
  + resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + location                      = "eastus"
      + machine_learning_workspace_id = (known after apply)
      + name                          = "mlcc-rms-dev-uks-01"
      + node_public_ip_enabled        = true
      + ssh_public_access_enabled     = (known after apply)
      + subnet_resource_id            = (known after apply)
      + vm_priority                   = "LowPriority"
      + vm_size                       = "STANDARD_D2DS_V4"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + scale_settings {
          + max_node_count                       = 1
          + min_node_count                       = 0
          + scale_down_nodes_after_idle_duration = "PT30S"
        }
    }

  # module.machine_learning["mlw1"].azurerm_machine_learning_workspace.machine_learning_workspace will be created
  + resource "azurerm_machine_learning_workspace" "machine_learning_workspace" {
      + application_insights_id       = (known after apply)
      + discovery_url                 = (known after apply)
      + id                            = (known after apply)
      + key_vault_id                  = (known after apply)
      + location                      = "eastus"
      + name                          = "azml-elx-dev-eun-01"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "elex-demo-eu2-rg-0001"
      + sku_name                      = "Basic"
      + storage_account_id            = (known after apply)
      + tags                          = {
          + "application" = "elx"
          + "costcentre"  = "tbc"
          + "createdby"   = "IaC"
        }
      + v1_legacy_mode_enabled        = false
      + workspace_id                  = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

<details><summary>Show Checkov Results</summary>


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.4.39 
terraform scan results:

Passed checks: 0, Failed checks: 3, Skipped checks: 0

Check: CKV_AZURE_144: "Ensure that Public Access is disabled for Machine Learning Workspace"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_workspace.machine_learning_workspace
	File: /terraform/modules/machine-learning/ml.tf:1-22
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-networking-policies/ensure-azure-machine-learning-workspace-is-not-publicly-accessible.html

		1  | resource "azurerm_machine_learning_workspace" "machine_learning_workspace" {
		2  |   name                    = "azml-elx-${var.machine_learning_workspace.env}-eun-${var.machine_learning_workspace.instance_number}"
		3  |   location                = var.machine_learning_workspace.location
		4  |   resource_group_name     = var.machine_learning_workspace.resource_group_name
		5  |   application_insights_id = data.azurerm_application_insights.application_insights.id
		6  |   key_vault_id            = data.azurerm_key_vault.key_vault.id
		7  |   storage_account_id      = data.azurerm_storage_account.storage_account.id
		8  |   # container_registry_id   = data.azurerm_container_registry.container_registry.id
		9  |   sku_name                = try(var.machine_learning_workspace.sku_name, null)
		10 |   description             = try(var.machine_learning_workspace.description, null)
		11 |   friendly_name           = try(var.machine_learning_workspace.friendly_name, null)
		12 |   high_business_impact    = try(var.machine_learning_workspace.high_business_impact, null)
		13 |   tags                    = try(var.machine_learning_workspace.tags, null)
		14 | 
		15 |   dynamic "identity" {
		16 |     for_each = try(var.machine_learning_workspace.identity, null) != null ? [var.machine_learning_workspace.identity] : []
		17 |     content {
		18 |       type = try(var.machine_learning_workspace.identity.type, "SystemAssigned")
		19 |     }
		20 |   }
		21 | 
		22 | }

Check: CKV_AZURE_142: "Ensure Machine Learning Compute Cluster Local Authentication is disabled"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-iam-policies/ensure-azure-machine-learning-compute-cluster-local-authentication-is-disabled.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-rms-${each.value.env}-uks-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }

Check: CKV_AZURE_150: "Ensure Machine Learning Compute Cluster Minimum Nodes Set To 0"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-general-policies/ensure-azure-machine-learning-compute-cluster-minimum-nodes-is-set-to-0.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-rms-${each.value.env}-uks-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }



Wrote output in SARIF format to the file 'results.sarif'

</details>

*Pushed by: @amro-acc, Action: `pull_request`, Workflow: `Dev-Apply-Machine-Learning`*